<?php

// 의사소통과 협업 능력, 

// php 기술, 

// 프레임워크(라라벨) 개념

// 프로젝트에 대한 이해도와 현업에서 비지니스적인 로직, 모델을 
// 설명해주신다 함

// 웹페이지 제작의 방향성 제시
// 에러는 내가 해결

// 2차 때 라라벨 진행
// mvc 모델을 이용해서 웹사이트를 제작함 이 모델이 조금씩 다르다
// 개발자마다 어떤 기준인지 다르기 때문

// 라라벨이 mvc 모델 순수 php로 mvc 모델할려고 했으나 
// 2차에 라라벨을

// 부트스트랩은 자기주도적 학습으로 하는데 3차 프로젝트까지 하고
// 시간 남으면 한다고 하심


// 소스코드 가독성 처리하는 과정을 알기 쉬운가 
// 효율을 떠나서 다른 방법도 있는데 왜 그렇게 했는지
// 그 방법이 더 좋은지 아닌지 확인해봐야 함.

// 의견을 조율하는 과정에서 협업 능력이 생기고
// 어떤 지적을 했고 내 생각은 어떤 거고 상대방은 어떤 대답을 했다
// 지적 받은 상대방도 어떤 것을 지적하고 궁금해했고 나는 어떻게 답변했다라고
// 이력을 남겨야 하고 최종적으로 합의한 내용을 이력으로 남기기
// 워드나 메모장으로 회의록 작성하기
// 소스코드 리뷰는 실시간으로 해야 함
// 짝 지어서 소스코드 리뷰하기
?>