// 데이터 타입

//---------------------------
// 자바스크립트 기본 데이터 타입
//---------------------------

// 숫자 타입 (number) 자바스크립트는 number, PHP는 int
let num = 1;
// 문자열 (string)
let str = "안녕";
// 불리언 (boolean 참 거짓 할 때 그 boolean)
let bool = true;
// 아무것도 없는 값 (null)
let test1 = null;

// undefined (null과 차이가 있다)
let test2;

// 심볼 (symbol 원래 없었는데 에크마 6 버전이 되면서 추가됨 자주 쓰이지는 않음)
const S_CONST1 = Symbol("심볼입니다.");
const S_CONST2 = Symbol("심볼입니다.");

// 클래스는 항상 첫 글자가 대문자로 시작함
// 배열은 자바스크립트에서 기본 데이터 타입이 아님
// 백엔드는 보통 배열이란 타입이 있는데 자바스크립트에서는 아니다
// 그것이 바로 객체 타입


//------------
// 객체 타입
//------------
let obj1 = {
    u_name: "홍길동"
}  


// 자스는 객체를 표현할 때 중괄호를 쓴다.

// 배열

// DATE

// OBject

// 함수도 포함됨