<?php

    // print "안녕하세요.\n";
    // print ("안녕하세요. 괄호입니다.\n");

    // echo "안녕하세요. 에코입니다.\n";
    // 현업에서는 에코를 많이 사용.
    // var_dump(print "안녕하세요");

    // $test_num = '변수변수'; 
    
    // 제일 앞에 숫자가 오면 변수가 만들어지지 않는다.
    // $ADSDA = 1;
    // echo $test_num;

    // 네이밍 기법  
    // 1. 카멜 기법 : 낙타의 등을 연상하고, 단어와 
    // 단어사이의 제일 첫 글자는 대문자로 쓰고 나머지는 소문자로 쓰는
    // 기법    예) $TestNum 자바가 주로 씀
    
    // 2. 스네이크 기법 : 뱀을 연상하고, 단어와 단어 사이를 "_" 이어 
    // 주고 전부 소문자로 작성하는 기법
    // 예) $test_num C언어와 PHP가 자주 씀


    // echo ("점심메뉴 \n 탕수육 8,000 \n 짜장면 6,000 \n 짬뽕 6,000 ");

 

    // echo ("점심메뉴 \n탕수육 8,000\n 짜장면6,000\n 짬뽕 6,000\n ");

 
    // echo "점심메뉴\n";
    // echo $tang.$blank.$price_8000.$line;
    // echo $zza.
    // echo $zzam;

    // $tang= "탕수육 8,000";
    // $zza= "짜장면 6,000";
    // $zzam= "짬뽕 6,000";
    // $blank = " \n";
    // $line = " \n" ;
    // $price_8000 = "8,000";
    // $price_6000 = "6,000";


    // echo "점심메뉴\n";
    // echo "탕수육 8,000\n";
    // echo "짜장면 6,000\n";
    // echo "짬뽕 6,000";




    // print "탕수육 $value. 8,000";
    // print "짜장며ㅛㄴ $value. 8,000";
    // print "탕수육 $value. 8,000";
    

    


?>