<?php
    // 1. 산술연산자 
    // echo "더하기 : 1 + 1 =", 1 + 1;
    // echo "\n빼기 : 1 - 1 = ", 1 - 1;
    // echo "\n곱하기 : 2 * 3 = ", 2 * 3;
    // echo "\n나누기 : 10 / 2; =", 10 /2;
    // echo "\n나머지 : 9 % 7 = ", 9 % 7;
    // echo "/n연산순서 : 10- 5 * 8 = " , 10 - 5 * 8;
    // echo "\n","\n";
    
    // 2. 증가/감소 연산자
    // $num1 = 1;
    // $num2 = 1;
    
    // ++$num;
    // $num1 = $num1 +1;

    // $num++;

    // $test_num = '변수변수'
    // $test_num = '0' 덮어쓰게 됨


    // echo $num1++, "\n";
    // echo $num1;

    // 3. 산술 대입 연산자
    // $num1 = 1;
    // $num1 = $num +1; 
    // 얘를 간략화 하는게 산술 대입 연산자다
    // $num2 += 1;
    // $num2 = 1;
    
    // $num2 = $num2 -1;
    // $num2 -= 1;
    
    
    // $num2 = $num2 = *1;
    // $num2 *= 1;
    
    
    // $num2 = $num2 = /1;
    // $num2 /= 1;

    // $num2 = $num2 = %1;
    // $num2 %= 1;

    // echo $num1, " ",$num2;

    // 산술 연산자를 이용해서 계산해주세요. (각각의 과정을 출력해주세요.)
    // $tng_num = 10;

    // $tng_num에 10을 더해주세요.
    // $tng_num에 5로 나눠주세요.
    // $tng_num에 4를 빼주세요.
    // $tng_num에 7로 나눈 나머지를 구해주세요.
    // $tng_num에 3을 곱해주세요.


    // 산술 연산자 예제 문제
    
    // echo 10+10/5-4%7*3, "\n";

    // $tng_num = 10;


    
    // echo $tng_num + 10, "\n";
    // echo $tng_num / 5, "\n";
    // echo $tng_num - 4, "\n";
    // echo $tng_num % 7, "\n";
    // echo $tng_num * 3, "\n", "\n";
    
    

    // =을 해줘야 메모리에 정보를 저장한다.


    // 산술대입 연산자 예제 문제
    // echo $tng_num += 10, "\n";
    // echo $tng_num /= 5, "\n";
    // echo $tng_num -= 4, "\n";
    // echo $tng_num %= 7, "\n";
    // echo $tng_num *= 3, "\n";

    // $t1 = 0;
    // $t2 = $t1 +1;
    // $t3 = 4;
    // $t3 = $t1 + $t2;

    // $t1 = 3;
    
    // echo $t1," ", $t2," ", $t3;

   
    // 4. 비교 연산자
    // $t1 = 1;
    // $t2 = '1';
    // var_dump(1 > 2);
    // var_dump(1 < 2);
    // var_dump(1 >= 2);
    // var_dump(1 <= 2);
    // var_dump(1 == '1');
    // var_dump($t1 == $t2);
    // // 생긴 모양이 같으면 같다라고 해줌
    // var_dump(1 === '1');
    // var_dump($t1 === $t2);
    // // 데이터 형식이 같아야 같다고 판단함
    
    // var_dump($t1 != $t2);
    // var_dump($t1 !== $t2);
    

    // 5. 논리 연산자
    // var_dump( 1 == 1 && 2 == 2);
    // var_dump( 1 == 1 && 2 == 3);
    // 앤드 연산자는 둘 다 트루일 때 트루 값이 나오고 하나라도
    //  펄스면 펄스 결과 값이 나온다.
    // var_dump( 1 == 1 || 2 == 3);
    // 오알 연산자는 둘 중 하나만 트루를 만족해도 트루가 나온다
    // var_dump( !(1 == 1) );
    // 트루가 나오면 펄스, 펄스가 나오면 트루로 바꿔주는 연산 값


    // echo $price = 1024;
    // echo $price * 64;
    // echo $price / 64;
    // echo $price + 64;
    // echo $price - 64;


    // $result = 5+3*2-(5+4)%2;
    // echo($result);


    // $val = 999991;
    // print $val."<BR>";
    // $val++;

    // $val = $val * 10;
    // print $val. "<BR>";

    // 변수는 쌍따옴표 안에 있으면 안 된다.
    // 변수가 문자로 합쳐지고 싶으면 .으로 연결해준다.


    
?>